package com.cware.partner.common.code;

/**
 * 패션플러스 ISBN 필수 카테고리 목록
 */
public enum FapleIsbnCat {

	비디오("50060101"),
	기타("50060201"),	
	일반도서("50060202"),
	기타2("50060301"),
	동화책("50060302"),
	온라인강의("50060401"),
	기타3("50060503"),
	도서("50060504"),
	기타4("50070101"),
	교육("55010101"),
	만화("55010102"),
	일반도서2("55010103"),
	국어("55011001"),
	명작("55011002"),
	수학("55011003"),
	아동전집("55011004"),
	위인("55011004"),
	창작동화("55011006"),
	영어동화("55011301"),
	영어학습("55011302"),
	제2외국어("55011303"),
	챕터북("55011304"),
	그림책("55011401"),
	보드북("55011402"),
	사운드북("55011403"),
	색칠("55011404"),
	스티커북("55011405"),
	유아전집("55011406"),
	퍼즐("55011407"),
	헝겊책("55011408"),
	국어2("55011601"),
	명작2("55011602"),
	수학2("55011603"),
	역사("55011604"),
	창작동화2("55011605"),
	초등전집("55011606"),
	학습만화("55011607"),
	학습사전("55012101"),
	학습전과("55012102"),
	학습지("55012103"),
	홈쇼핑("55012401");
		
	private final String label;
	
	FapleIsbnCat(String label) {
        this.label = label;
    }
	
    public String label() {
        return label;
    }

}
